In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('MyNumbers')

+-----+
| num |
+-----+
|  8  |
|  8  |
|  3  |
|  3  |
|  1  |
|  4  |
|  5  |
|  6  |
+-----+

### A single number is a number that appeared only once in the MyNumbers table. Write an SQL query to report the largest single number. If there is no single number, report `null`.
```
+-----+
| num |
+-----+
| 6   |
+-----+
Explanation: The single numbers are 1, 4, 5, and 6.
Since 6 is the largest single number, we return it.
```

In [3]:
%%sql 

SELECT num
FROM MyNumbers 
GROUP BY num
HAVING COUNT(num) = 1;

[(1,), (4,), (5,), (6,)]

In [4]:
%%sql 
SELECT 
    COALESCE(MAX(num), null) AS num
FROM (
    SELECT num
    FROM MyNumbers
    GROUP BY num 
    HAVING COUNT(num) = 1) inner_table

[(6,)]

# Using Pandas

In [5]:
import pandas as pd

In [6]:
mynumbers_query = %sql SELECT * FROM MyNumbers # type: ignore 
mynumbers_df = mynumbers_query.DataFrame()

display(mynumbers_df)

   num
0    8
1    8
2    3
3    3
4    1
5    4
6    5
7    6

In [7]:
mynumbers_df.groupby('num').agg({'num': 'count'})

     num
num
1      1
3      2
4      1
5      1
6      1
8      2

In [8]:
grouped_df = mynumbers_df.groupby('num').agg(num_count=('num', 'count'))
grouped_df

     num_count
num
1            1
3            2
4            1
5            1
6            1
8            2

In [9]:
grouped_df = grouped_df.reset_index()
grouped_df

   num  num_count
0    1          1
1    3          2
2    4          1
3    5          1
4    6          1
5    8          2

In [10]:
grouped_df.query("num_count == 1")

   num  num_count
0    1          1
2    4          1
3    5          1
4    6          1

In [11]:
filtered_df = grouped_df.query("num_count == 1")
filtered_df

   num  num_count
0    1          1
2    4          1
3    5          1
4    6          1

In [12]:
filtered_df.query("num == num.max()")

   num  num_count
4    6          1

In [13]:
result = filtered_df.query("num == num.max()")[['num']]
result

   num
4    6

In [14]:
# Using the 'empty' attribute of the DataFrame, assign an empty DataFrame to the result
result = result if not result.empty else pd.DataFrame()
result

   num
4    6